src/Catalogs/EmailAccounts.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>EmailAccounts</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>UserName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EmaiAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMTPServer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>POP3Server</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMTPPort</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>POP3Port</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>User</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Password</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMTPAuthentication</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SMTPAuthenticationSettings</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMTPAuthenticationMode</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SMTPAuthenticationMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMTPUser</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMTPPassword</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>POP3AuthenticationMode</Name>
					<Type>
						<v8:Type>cfg:EnumRef.POP3AuthenticationMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Timeout</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LeaveMessageCopiesAtServer</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RemoveFromServerAfter</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseForSending</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UseForReceiving</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IncludeUserNameInPresentation</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ResponsibleForMessagesProcessing</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/SMTPAuthenticationSettings.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>SMTPAuthenticationSettings</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>SimilarlyPOP3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SpecifiedAsParameters</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>POP3BeforeSMTP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NotDefined</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/SMTPAuthenticationMethods.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>SMTPAuthenticationMethods</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>CramMD5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Login</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Plain</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>None</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Default</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/POP3AuthenticationMethods.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>POP3AuthenticationMethods</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>APOP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CramMD5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>General</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/EmailAccounts/Ext/ObjectModule.bsl
Procedure Filling(FillingData, StandardProcessing)
	
	FillObjectByDefaultValues();
	
EndProcedure

Procedure FillObjectByDefaultValues() Export
	
	UserName = "1c:Enterprise";
	SMTPAuthentication = Enums.SMTPAuthenticationSettings.NotDefined;
	UseForReceiving = False;
	LeaveMessageCopiesAtServer = False;
	RemoveFromServerAfter = 0;
	Timeout = 30;
	SMTPAuthentication    = Enums.SMTPAuthenticationSettings.NotDefined;
	SMTPAuthenticationMode = Enums.SMTPAuthenticationMethods.None;
	POP3AuthenticationMode = Enums.POP3AuthenticationMethods.General;
	SMTPUser = "";
	SMTPPassword = "";
	POP3Port = 110;
	SMTPPort = 25;
	
EndProcedure
